package com.rafsan.hellopolice;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.text.TextUtils;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.GridView;
import android.widget.ImageView;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.HashMap;

import soup.neumorphism.NeumorphCardView;

public class ChattogramDiv extends AppCompatActivity {

    TextView textMarque,callNumber1,callNumber2,callNumber3;

    ImageView callButton1,callButton2,callButton3;

    GridView chattogramGridView;

    ArrayList<HashMap<String,String>> arrayList = new ArrayList<>();
    HashMap<String,String> hashMap;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_chattogram_div);

        textMarque = findViewById(R.id.textMarque);
        textMarque.setEllipsize(TextUtils.TruncateAt.MARQUEE);
        textMarque.setSelected(true);

        //==============================================
        //==============================================
        callNumber1 = findViewById(R.id.callNumber1);
        callNumber2 = findViewById(R.id.callNumber2);
        callNumber3 = findViewById(R.id.callNumber3);

        callButton1 = findViewById(R.id.callButton1);
        callButton2 = findViewById(R.id.callButton2);
        callButton3 = findViewById(R.id.callButton3);

        callButton1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber1.getText().toString();
                Intent myIntent = new Intent(Intent.ACTION_CALL);
                myIntent.setData(Uri.parse("tel:"+number));
                startActivity(myIntent);
            }
        });
        callButton2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber2.getText().toString();
                startActivity(new Intent(Intent.ACTION_CALL,Uri.parse("tel:"+number)));
            }
        });

        callButton3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber3.getText().toString();
                startActivity(new Intent(Intent.ACTION_CALL,Uri.parse("tel:"+number)));
            }
        });
        //==============================================
        //==============================================

        chattogramGridView = findViewById(R.id.chattogramGridView);

        chattogramDisTable();

        MyChattogram myChattogram = new MyChattogram();
        chattogramGridView.setAdapter(myChattogram);

    }

    private  class MyChattogram extends BaseAdapter{

        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup parent) {

            LayoutInflater layoutInflater = getLayoutInflater();
            View myView = layoutInflater.inflate(R.layout.districts_list,parent,false);

            TextView textDistrict = myView.findViewById(R.id.textDistrict);
            NeumorphCardView disCardView = myView.findViewById(R.id.disCardView);

            HashMap<String,String> hashMap1 = arrayList.get(position);

            String districtName = hashMap1.get("districtName");
            textDistrict.setText(districtName);

            String policeCall = hashMap1.get("policeCall");
            String history = hashMap1.get("history");
            String policeStationName = hashMap1.get("policeStationName");

            disCardView.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {
                    if (districtName.contains("Cumilla")){

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }
                    else if (districtName.contains("Feni")) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }
                    else if (districtName.contains("Brahmanbaria")) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }
                    else if ( districtName.contains("Rangamati") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Noakhali") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Chandpur") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Lakshmipur") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Chattogram") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Coxsbazar") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Khagrachhari") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }else if ( districtName.contains("Bandarban") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(ChattogramDiv.this, PoliceInformationDetail.class));
                    }
                }
            });

            return myView;
        }
    }

    private void chattogramDisTable(){
        hashMap = new HashMap<>();
        hashMap.put("districtName","Cumilla");
        hashMap.put("policeCall","Cumilla");
        hashMap.put("policeStationName","Cumilla Police Station");
        hashMap.put("history","বর্তমান কুমিল্লা চট্টগ্রাম বিভাগের অধীন একটি জেলা। প্রাচীনকালে এটি সমতট জনপদের অন্তর্গত ছিল এবং পরবর্তীতে এটি ত্রিপুরা রাজ্যের অংশ হয়েছিল। এ অঞ্চলে প্রাপ্ত প্রাচীন নিদর্শনাদি থেকে যতদূর জানা যায় খ্রিস্টীয় পঞ্চম শতাব্দী থেকে ত্রিপুরা গুপ্ত সম্রাটদের অধিকারভুক্ত ছিল। ঐতিহাসিকদের মতে সপ্তম থেকে অষ্টম শতকের মধ্যভাগ পর্যন্ত এ অঞ্চলে বৌদ্ধ দেববংশ রাজত্ব করে। নবম শতাব্দীতে কুমিল্লা হরিকেলের রাজাগণের শাসনাধীনে আসে। প্রত্নপ্রমাণ হতে পাওয়া যায় যে, দশম হতে একাদশ শতাব্দীর মধ্যভাগ পর্যন্ত প্রায় দেড়শ বছর এ অঞ্চল চন্দ্র রাজবংশ দ্বারা শাসিত হয়েছে।\n" +
                "\n" +
                "    মধ্যবর্তী সময়ে মোঘলদের দ্বারা শাসিত হওয়ার পরে ১৭৬৫ সালে এটি ইস্ট ইন্ডিয়া কোম্পানীর অধীনে আসে। রাজস্ব আদায়ের সুবিধার্থে কোম্পানী ১৭৬৯ খ্রিস্টাব্দ প্রদেশে একজন তত্ত্বাবধায়ক  নিয়োগ করে। তখন কুমিল্লা ঢাকা প্রদেশের অন্তর্গত ছিল। ১৭৭৬ খ্রিস্টাব্দে কুমিল্লাকে কালেক্টরের অধীন করা হয়। ১৭৯০ সালে ত্রিপুরা জেলা গঠনের মাধ্যমে ত্রিপুরা কালেক্টরেটের যাত্রা শুরু হয়। ১৭৯৩ সালে তৃতীয় রেগুলেশন অনুযায়ী ত্রিপুরা জেলার জন্য একজন দেওয়ানি জজ নিযুক্ত করা হয় এবং সে বছরই তাকে ম্যাজিস্ট্রেসি ক্ষমতা দেওয়া হয়। ১৮৩৭ সালে ম্যাজিস্ট্রেট ও কালেক্টরের পদগুলিকে পৃথক করা হয়। ১৮৫৯ সালে আবার এই দুটি পদকে একত্রিত করা হয়। ১৯৪৭ সালে দেশ বিভাগের পরবর্তী সময়ে ১৯৬০ সালে ত্রিপুরা জেলার নামকরণ করা হয় কুমিল্লা এবং তখন থেকে জেলা ম্যাজিস্ট্রেট ও কালেক্টর পদটির নামকরণ হয় ডেপুটি কমিশনার। ১৯৮৪ সালে কুমিল্লার দু'টি মহকুমা চাঁদপুর ও ব্রাহ্মণবাড়িয়াকে পৃথক জেলা হিসেবে পুনর্গঠন করা হয়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Feni");
        hashMap.put("policeCall","Feni");
        hashMap.put("policeStationName","Feni Police Station");
        hashMap.put("history","ফেনী নদীর নাম অনুসারে এ অঞ্চলের নাম রাখা হয়েছে ফেনী।মধ্যযুগে কবি ও সাহিত্যিকদের কবিতা ও সাহিত্যে একটা বিশেষ নদীর স্রোতধা ও ফেরী পারা পারের ঘাট হিসেবে আমরা ফনী শব্দ পাই। ষোড়শ শতাব্দীতে কবি কবীন্দ্র পরমেশ্বর পরাগলপুরের বর্ণনায় লিখছেনঃ “ফনী নদীতে বেষ্টিত চারিধার,পূর্বে মহাগিরি পার নাই তার।” সতের শতকে মির্জা নাথানের ফার্সী ভাষায় রচিত “বাহরিস্তান-ই-গায়েবীতে” ফনী শব্দ ফেনীতে পরিণত হয়। আঠার শতকের শেষভাগে কবি আলী রেজা প্রকাশ কানু ফকির তার পীরের বসতি হাজীগাওর অবস্থান সম্পর্কে লিখছেনঃ “ ফেনীর দক্ষিণে এক ষর উপাম, হাজীগাও করিছিল সেই দেশের নাম।”কবি মোহাম্মদ মুকিম তার পৈতৃক বসতির বর্ণনাকালে বলেছেনঃ “ ফেনীর পশ্চিমভাগে জুগিদিয়া দেশে.........।“ বলাবাহুল্য, তারাও নদী অর্থে ফেনী ব্যবহার করেছেন। মনে হয় আদি শব্দ ‘ফনী’ মুসলমান কবি ও সাহিত্যিকদের ভাষায় ফেনীতে পরিণত হয়েছে।\n" +
                "\n" +
                "১৮৭২-৭৪ সালের মধ্যে মোগল আমলের আমীরগাও থানা নদী ভাঙ্গনের মুখোমুখি হলে তা ফেনী নদীর ঘাটের অদূরে খাইয়অ্যা্রাতে স্থানান্তরিত হয়েছিল। ঐ থানাটি কোম্পানীর কাগজ পত্রে ফেনী থানা (ফেনী নদীর অদূরে বলে) নামে পরিচিত হয়।অতঃপর ১৮৭৬ সালে নতুন মহকুমার পত্তন হলে খাইয়অ্যা্রা থেকে থানা দপ্তরটি মহকুমা সদরে স্থানান্তরিত হয় ও নতুন মহকুমাটি ফেনী নামে পরিচিত হয়।\n" +
                "\n" +
                "দূর অতীতে এ অঞ্চল ছিল সাগরের অংশ; তবে উত্তর পূর্ব দিক ছিল পাহাড়িয়া অঞ্চলের পাদদেশ।ফেনীর পূর্বদিকের রঘুনন্দন পাহাড় থেকে কাজির বাগের পোড়ামাটি অঞ্চলে হয়তঃ আদিকালে শিকারী মানুষের প্রথম পদচিহ্ন পড়েছিল।এখানকার ছাগলনাইয়া গ্রামে ১৯৬৩ সালে একটা পুকুর খননকালে নব্য প্রস্তর যুগের মানুষের ব্যবহৃত একটা হাতিয়ার বা হাতকুড়াল পাওয়া গেছে।পন্ডিতদের মতে ঐ হাতকুড়াল প্রায় পাচ হাজার বছরের পুরাতন।\n" +
                "\n" +
                "বৃহত্তর নোয়াখালীর মধ্যে পূর্বদিকের ফেনী অঞ্চলকে ভূ-খন্ড হিসেবে অধিকতর প্রাচীন বলে পন্ডিতগণ মত প্রকাশ করেছেন। ফেনীর পূর্বভাগের ছাগল নাইয়া উপজেলার শিলুয়া গ্রামে রয়েছে এক প্রাচীন ঐতিহাসিক শিলামূর্তির ধ্বংসাবশেষ।প্রকাশ শিলামূর্তির অবস্থানের কারণে স্থানটি শিলুয়া বা শিল্লা নামে পরিচিত হয়েছে।প্রাচীন কালে হয়ত এখানে বৌদ্ধ ধর্ম ও কৃষ্টির বিকাশ ঘটেছিল।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Brahmanbaria");
        hashMap.put("policeCall","Brahmanbaria");
        hashMap.put("policeStationName","Brahmanbaria Police Station");
        hashMap.put("history","ব্রাহ্মণবাড়িয়া জেলা ১৯৮৪ সালে প্রতিষ্ঠিত হয়। এর পূর্বে এই জেলা কুমিল্লা (পুরাতন নাম টিপরা) জেলার অন্তর্ভূক্ত ছিল। উল্লেখ্য ১৮৩০ সালের পূর্বে সরাইল পরগণা ময়মনসিংহ জেলার অন্তর্ভূক্ত ছিল।\n" +
                "\n" +
                "এ অঞ্চল প্রাচীন বাংলার সমতট নামক জনপদের অংশ ছিল।মধ্যযুগে আজকের ব্রাহ্মণবাড়িয়া ছিল সরাইল পরগনার অন্তর্গত। ঐতিহাসিক তথ্য উপাত্তে জানা যায় পাঠান সুলতান শেরশাহ রাজস্ব আদায় ও শাসন কার্য পরিচালনার সুবিধার্থে প্রথম পরগনার সৃষ্টি করেন। সুলতানী আমলেই সরাইল পরগনার সৃষ্টি হয়। রাজনৈতিক কারণে সরাইল পরগনা কখনো কখনো গুরুত্বপূর্ণ হয়ে উঠে। বাংলার বার ভূইয়ার শ্রেষ্ঠ ভূইয়া মসনদ-এ আলা ঈসা খাঁর বংশ পরিচয় থেকে জানা যায় ভারতের বাইশওয়ারা রাজ্যের এক যুবরাজ কালিদাস গজদানী সৈয়দ ইব্রাহীম মালেকুলউলামা (রাঃ) এর নিকট ইসলাম ধর্ম গ্রহণ করে সোলায়মান খাঁ নাম ধারণ করেন। সোলায়মান খাঁ ১৫৩৪ খ্রিস্টাব্দে বঙ্গে আগমন করেন। তিনি সুলতান গিয়াস উদ্দিন মাহমুদ শাহের পর থেকে সর্বপ্রথম সরাইল পরগনার জায়গীর প্রাপ্ত হন। সোলায়মান খাঁর প্রতিদ্বন্দ্বী পাঠান বাহিনী মিথ্যা সন্ধির প্রস্তাবে ডেকে নিয়ে তাকে হত্যা করে। এ সময়ে ঈসা খাঁর বয়স ছিল দশ বছর। পরবর্তীতে স্বীয় প্রতিভা বলে তিনি ভাটীরাজ্যের এক বিরাট শক্তিতে পরিণত হন। ভাটী রাজ্যের স্বাধীনতা রক্ষায় ঈসা খাঁর সঙ্গে মোঘল বাহিনীর যুদ্ধ ইতিহাসের পাতায় লিপিবদ্ধ রয়েছে। ঈসা খাঁ সে সময়ে সরাইলে অস্থায়ী রাজধানী স্থাপন করেন। ১৫৮১ খ্রিস্টাব্দের দিকে তিনি ভাটীরাজ্যের একচ্ছত্র অধিপতি রূপে তাঁর শাসনকেন্দ্র সরাইল থেকে রসানার গাঁয়ে এবং সাময়িক ক্ষেত্রে কিশোরগঞ্জের জঙ্গল বাড়িতে স্থানান্তর করেন। ১৭৯৩ খ্রিস্টাব্দে ত্রিপুরা জেলা প্রতিষ্ঠিত হওয়ার সময় ব্রাহ্মণবাড়িয়ার অধিকাংশ এলাকা ময়মনসিংহ জেলার অর্ন্তভূক্ত ছিল। ১৮৩০ সালে সরাইল, দাইদপুর, হরিপুর, বেজুরা ও সতরকন্ডল পরগনা, ময়মনসিংহ হতে ত্রিপুরা জেলার কাছে হস্তান্তর করা হয়। ১৮৬০ সালে নাসিরনগর মহকুমা প্রতিষ্ঠিত হলে ব্রাহ্মণবাড়িয়ার অধিকাংশ এর অধীনস্থ হয়। ১৮৭৫ সালে নাসিরনগর মহকুমার নাম পরিবর্তন করে ব্রাহ্মণবাড়িয়া মহকুমা করা হয়। তৎপূর্বেই ১৮৬৮ খ্রিস্টাব্দে ব্রাহ্মণবাড়িয়া শহর পৌরসভায় উন্নীত হয়। ১৯৪৭ পরবর্তী সময়ে বৃহত্তর কুমিল্লা জেলা পূর্ব পাকিস্তানের অন্তর্গত হয়। ১৯৬০ সালে ত্রিপুরা জেলার পূর্ব পাকিস্তান অংশের নামকরণ হয় কুমিল্লা জেলা। তখন ব্রাহ্মণবাড়িয়া একটি মহকুমা শহর নামে পরিচিত ছিল। ১৯৭১ সালে বাংলাদেশ এক রক্তক্ষয়ী মুক্তিযুদ্ধের মাধ্যমে স্বাধীনতা লাভ করে। স্বাধীনতা উত্তর প্রশাসনিক বিকেন্দ্রীকরণের সময় ১৯৮৪ সালের ১৫ ফেব্রুয়ারি ব্রাহ্মণবাড়িয়াকে জেলা ঘোষণা করা হয়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Rangamati");
        hashMap.put("policeCall","Rangamati");
        hashMap.put("policeStationName","Rangamati Police Station");
        hashMap.put("history","শাসকদের মধ্যে বিবাদ\n" +
                "\n" +
                "ভৌগোলিক ভাবে হিমালয় অঞ্চল হতে দূরে দক্ষিণে শাখা প্রশাখায় বিস্তৃত পাহাড়ি এলাকা নিয়ে বৃহত্তর পার্বত্য চট্টগ্রাম জেলার অবস্থান। আসাম ও পার্বত্য ত্রিপুরা হতে আরাকান ও বার্মার সীমান্ত পর্যন্ত। ফলে পার্বত্য চট্টগ্রাম ও চট্টগ্রাম জেলা ছিল পার্বত্য ত্রিপুরা এবং আরাকান শাসকদের একটি বিবাদের বিষয়। আর একারণে এ অঞ্চলের রাজ বংশের প্রতিষ্ঠাতা রাজা যুজা রূপা (বিরা রাজা) ৫৯০ খ্রিস্টাব্দে পার্বত্য চট্টগ্রামের রাজাকে পরাজিত করেন এবং রাঙ্গামাটিতে তার রাজধানী স্থাপন করেন। আবার ঐতিহ্যগত মতানুসারে, পার্বত্য ত্রিপুরার রাজা উদয়গিরি কিলয় ও মংলয় নামের দু’ভাইকে রিয়াং এলাকার অফিসার-ইন-চার্জ নিয়োগ করেন। তারা মাতামুহুরী নদীর দক্ষিণে পাহাড়ি অঞ্চলে বসবাস করতেন। ৯৫৩ খ্রিস্টাব্দে আরাকান রাজা সুলা সান্দ্র (Tsula Tsandra) (৯৫১-৯৫৭) বৃহত্তর পার্বত্য চট্টগ্রাম ও চট্টগ্রাম দখল করেন। পরবর্তীতে ১২৪০ খ্রিস্টাব্দে ত্রিপুরার রাজা পুনরায় এ অঞ্চল দখল করেন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "সুলতানী আমল\n" +
                "\n" +
                " সুলতান ফখরুদ্দিন মুবারক শাহ (১৩৩৮-৪৯) চট্টগ্রাম (সম্ভবতঃ পার্বত্য চট্টগ্রামের অংশসহ) জয় করেণ। ১৪০৬ খ্রিস্টাব্দে সুয়াং মংজিৎ আরাকানের সিংহাসন জোর পূর্বক দখল করেন এবং আরাকান রাজা মং সুয়ামন ওরয়ে ন্যারা মিখলা (১৪০৪-৩৪) কে গৌড়ের সুলতান জালাল উদ্দিন মুহাম্মদ শাহ (১৪১৮-৩১)-এর দরবারে আশ্রয় নিতে বাধ্য করেন। ১৪১৮ সালে চাকমা রাজা মউন স্নী বৌদ্ধ মতাদর্শের প্রতি অশ্রদ্ধা জ্ঞাপনের অভিযোগে বার্মার উর্ধাঞ্চল হতে বিতাড়িত হন। তিনি তৎকালীন পার্বত্য চট্টগ্রামের আলীকদম নামক স্থানে মুসলিম অফিসারের অধীনে আশ্রয় গ্রহণ করেন এবং রামু ও টেকনাফে চাকমাদের বসতি স্থাপন করেন। ১৪৩০ খ্রিস্টাব্দে সুলতান জালাল উদ্দিন মুহাম্মদ শাহের অধীনে ওয়ালী খান নামের একজন মিলিটারী অফিসার চট্টগ্রামে নিয়োজিত থাকা কালে যখন সুয়া মংজিৎকে বিতাড়িত করে মং সুয়ামনকে আরাকানের সিংহাসন পুনরুদ্ধার করে দিতে নির্দেশিত হন, তখন তিনি গৌড়ের সুলতানের বিরুদ্ধে রাজদ্রোহী হন। সুলতান জালাল উদ্দিন মুহাম্মদ শাহ্ একদল সৈন্য প্রেরণ করলে তারা ওয়ালী খানকে হত্যা করে এবং আরাকান আক্রমণ করে মগরাজা মং সুয়ামনকে আরাকারে সিংহাসন পুনরুদ্ধারে সাহায্য করে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Noakhali");
        hashMap.put("policeCall","Noakhali");
        hashMap.put("policeStationName","Noakhali Police Station");
        hashMap.put("history","নোয়াখালী জেলা'র মর্যাদা পায় ইষ্ট ইন্ডিয়া কোম্পানী কর্তৃক এদেশে জেলা প্রশাসন প্রতিষ্ঠার প্রাথমিক পরীক্ষা-নিরীক্ষার সময় থেকেই। ১৭৭২ সালে কোম্পানীর গভর্ণর জেনারেল ওয়ারেন হেস্টিংস এদেশে প্রথম আধুনিক জেলা প্রশাসন ব্যবস্থা প্রবর্তনের প্রচেষ্টা নেন। তিনি সমগ্র বাংলাদেশকে ১৯টি জেলায় বিভক্ত করে প্রতি জেলায় একজন করে কালেক্টর নিয়োগ করেন। এ ১৯টি জেলার একটি ছিল কলিন্দা। এ জেলাটি গঠিত হয়েছিল মূলতঃ নোয়াখালী অঞ্চল নিয়ে। কিন্তু ১৭৭৩ সালে জেলা প্রথা প্রত্যাহার করা হয় এবং প্রদেশ প্রথা প্রবর্তন করে জেলাগুলোকে করা হয় প্রদেশের অধীনস্থ অফিস।\n" +
                "\n" +
                " \n" +
                "\n" +
                "১৭৮৭ সালে পুনরায় জেলা প্রশাসন ব্যবস্থা প্রবর্তন করা হয় এবং এবার সমগ্র বাংলাদেশকে ১৪টি জেলায় ভাগ করা হয়। এ ১৪টির মধ্যেও ভুলুয়া নামে নোয়াখালী অঞ্চলে একটি জেলা ছিল। পরে ১৭৯২ সালে ত্রিপুরা নামে একটি নতুন জেলা সৃষ্টি করে ভুলুয়াকে এর অন্তর্ভূক্ত করা হয়। ১৮২১ সালে ভুলুয়া নামে নোয়াখালী জেলা প্রতিষ্ঠার সময় পর্যন্ত এ অঞ্চল ত্রিপুরা জেলার অন্তর্ভূক্ত ছিল।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Chandpur");
        hashMap.put("policeCall","Chandpur");
        hashMap.put("policeStationName","Chandpur Police Station");
        hashMap.put("history","চাঁদপুরের নামকরণ: ১৭৭৯ খ্রি. ব্রিটিশ শাসনামলে ইংরেজ জরিপকারী মেজর জেমস্ রেনেল তৎকালীন বাংলার যে মানচিত্র এঁকেছিলেন তাতে চাঁদপুর নামে এক অখ্যাত জনপদ ছিল। তখন চাঁদপুরের দক্ষিণে নরসিংহপুর নামক (যা বর্তমানে নদীগর্ভে বিলীন) স্থানে চাঁদপুরের অফিস-আদালত ছিল। পদ্মা ও মেঘনার সঙ্গমস্থল ছিল বর্তমান স্থান হতে প্রায় ৬০ মাইল দক্ষিণ-পশ্চিমে। মেঘনা নদীর ভাঙ্গাগড়ার খেলায় এ এলাকা বর্তমানে বিলীন হয়েছে। বার ভূঁইয়াদের আমলে চাঁদপুর অঞ্চল বিক্রমপুরের জমিদার চাঁদরায়ের দখলে ছিল। এ অঞ্চলে তিনি একটি শাসনকেন্দ্র স্থাপন করেছিলেন। ইতিহাসবিদ জে. এম. সেনগুপ্তের মতে, চাঁদরায়ের নাম অনুসারে এ অঞ্চলের নাম হয়েছে চাঁদপুর। অন্যমতে, চাঁদপুর শহরের (কোড়ালিয়া) পুরিন্দপুর মহল্লার চাঁদ ফকিরের নাম অনুসারে এ অঞ্চলের নাম চাঁদপুর। কারো মতে, শাহ আহমেদ চাঁদ নামে একজন প্রশাসক দিল্লী থেকে পঞ্চদশ শতকে এখানে এসে একটি নদীবন্দর স্থাপন করেছিলেন। তার নামানুসারে নাম হয়েছে চাঁদপুর। তিনি বাস করতেন পুরিন্দপুর এলাকায়। হাজীগঞ্জের ফিরোজশাহী মসজিদ মুসলিম স্থাপত্য কীর্তির অন্যতম নিদর্শন। যেটি ফখরুদ্দীন মোবারক শাহের দেওয়ান ফিরোজখান লস্কর নির্মাণ করেছেন বলে শিলালিপি থেকে জানা যায়। হাজীগঞ্জ উপজেলাধীন অলিপুর গ্রামে প্রখ্যাত মোঘল শাসক আব্দুল্লাহর প্রশাসনিক সদর দপ্তর ছিল। এখানে রয়েছে বাদশাহ আলমগীরের নামাঙ্কিত বিখ্যাত আলমগীরি পাঁচ গম্বুজ মসজিদ, শাহাজাদা সুজা স্থাপিত তিন গম্বুজবিশিষ্ট মসজিদ ও মোঘল আমলের বীর সেনানায়কদের শানবাঁধানো মাজার যা বর্তমানে অলিদের মাজার নামে খ্যাত। ব্রিটিশ আমলে প্রশাসনিক পূর্ণবিন্যাসের ফলে ১৮৭৮ সালে প্রথম চাঁদপুর মহকুমার সৃষ্টি হয়। ১৮৯৬ সালের ১ অক্টোবর চাঁদপুর শহরকে পৌরসভা হিসেবে ঘোষণা করা হয়। ১৯৮৪ সালে ১৫ ফেব্রুয়ারি চাঁদপুর জেলা হিসেবে আত্মপ্রকাশ করে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Lakshmipur");
        hashMap.put("policeCall","Lakshmipur");
        hashMap.put("policeStationName","Lakshmipur Police Station");
        hashMap.put("history","যে ভূখন্ড নিয়ে বর্তমান লক্ষ্মীপুর জেলা অবস্থিত তার আদি চিত্র এ রকম ছিল না। অধিকাংশ স্থানে বঙ্গোপসাগরের উত্তাল তরঙ্গমালা ক্রীড়ায় মত্ত থাকত। বিখ্যাত চীনা পরিব্রাজক হিউয়েন সাঙ তাঁর ‘সিউতী’ নামক ভ্রমণ বৃত্তান্তে ‘কমলাঙ্ক’কে সমুদ্র তীরবর্তী বলে বর্ণনা করেছেন। ‘কমলাঙ্ক’ বর্তমানে কুমিল্লা ও পূর্ববর্তী ত্রিপুরা জেলার প্রাচীন নাম। কবি কালিদাস তাঁর ‘রঘু বংশ’ কাব্যে ‘সুষ্মি দেশকে’ ‘তালিবন শ্যামকণ্ঠ’ বলে অভিহিত করেছেন। কুমিল্লা জেলার দক্ষিণাংশ এবং নোয়াখালীর উত্তরাংশকে ‘সুষ্মি দেশ’ বলে বুঝিয়েছেন। প্রাচীনকাল থেকে এ এলাকা সমূহে প্রচুর তালবৃক্ষ জন্মে। কথিত আছে, ত্রয়োদশ শতকের প্রথম দশকের গোড়ার দিকে ভুলুয়া রাজ্যের প্রতিষ্ঠাতা বিশ্বস্বর শুর মুর্শিদাবাদ থেকে চট্টগ্রামে (চাটগাঁও) নৌকা যোগে চন্দ্রনাথ তীর্থ দর্শনে যাবার পথে এ অঞ্চলে আসেন। এটি ছিল নিশ্চিতই নতুন জাগা চর। হয়তো তৎকালে ত্রিপুরা জেলার সাথে সম্পৃক্ত রায়পুর ও রামগঞ্জের উত্তরের ক্ষুদ্রতম কোন একাংশ প্রাচীন ভূখন্ড ছিল। বর্তমানে লক্ষ্মীপুর জেলার অধিকাংশ ভূমি, নদী বা সমুদ্র গর্ভ থেকে ক্রমশ চর বা দ্বীপ হিসেবে জেগে উঠে।এ জন্য জেলার বিভিন্ন এলাকার নামে সাথে চর, দ্বী, দি, দিয়া যুক্ত হয়। যে সব এলাকার সাথে পুর বা গঞ্জ যুক্ত হয়েছে সেগুলিও প্রাচীনতম নয়। নতুন বসতি স্থাপনকারিগণ এসব যুক্ত করেছেন। মাত্র ২ শত বছর পূর্বে এ অঞ্চলের ভূ-প্রকৃতি প্রত্যক্ষ করে স্কটিশ ভ্রমণকারী ড. ফ্রান্সিস বুকানন লিখেছেন (২ মার্চ ১৭৯৮) ‘‘সম্ভবত বিভিন্ন সময় চর ছিল অথবা এমনও হতে পারে এ অঞ্চল নদীর বালুকা নিয়ে গড়ে উঠেছে। সব জায়গায় মাটি নরম, ঢিলেঢালা; তার সঙ্গে মিশ্রিত আছে অভ্রাল বালু কণা এবং এ মাটির স্তর বিন্যস্ত নয়। তাছাড়া কাদামাটি এখানে নেই বললেই চলে। (৫ মার্চ ১৭৯৮) পাতা হাট (চরপাতা, রায়পুর) এবং লক্ষ্মীপুরের মধ্যবর্তী অঞ্চলে যে রকম চাষাবাদ করা হয়েছে, লক্ষ্মীপুর এবং নোয়াখালীর মধ্যবর্তী এলাকা অতটা আবাদি নয়। গাছ গাছালির ফাঁকে ফাঁকে গ্রামীণ মানুষের বসত বাড়ি বেশ ছাড়া ছাড়া এবং অনেক অঞ্চল এখনও প্রাকৃতিক অবস্থায় পড়ে আছে। পাতা হাটের তুলনায় এখানকার জমিন নিচু এবং প্রত্যেক ডোবা সুন্দরবনের গাছ গাছালিতে ভরা।’’ নোয়াখালীর ইতিহাস লেখক প্যারী মোহন সেন (১৯৪০)-এর বর্ণনায় দেখা যায় যে, ‘‘লক্ষ্মীপুর অঞ্চল এক সময় বঙ্গোপসাগরের অংশ ছিল। এক সময় যে স্থানে ভীষণ ঊর্মিমালা উত্থিত হইয়া মানবের ভীতি সঞ্চার করিত, সেই স্থান এক সময়ে অর্ণবচরগণে পরিব্যাপ্ত ছিল। অধুনা সেই স্থানে বহু সংখ্যক মানব সুখে সাচ্ছন্দ্যে কালাতিপাত করিতেছে।’’ ড. কাদের (১৯৯১)-এর বর্ণনায় দেখা যায়, ‘ফেনী নদীর পশ্চিম মেঘনা নদীর পূর্ব, ত্রিপুরা (কুমিল্লা) জেলার অন্তর্গত মেহারেরদক্ষিণ এই বিস্তীর্ণ ভূ-ভাগই সমুদ্র গর্ভজাত।’ এখানে নতুন ভূমি জেগে উঠলে দেশের বিভিন্ন অঞ্চলের মানুষ চাষাবাদ উপলক্ষে এবং আরব দেশের বহিরাগতরা ব্যবসা বাণিজ্য ও ধর্ম প্রচারের উদ্দেশ্যে জনবসতি গড়ে তোলে। তারপর মেঘনা নদী ভাঙা-গড়ার মধ্যে এবং প্রতিকূল প্রকৃতির সাথে সংগ্রাম করে করে লক্ষ্মীপুরের মানুষ টিকে আছে। এক সময়ের সমৃদ্ধ নগরী ইসলামাবাদ মেঘনা নদীর গর্ভে বিলীন হয়, কালক্রমে নদী গর্ভে আরো বিলুপ্ত হয় সমুদ্র উপকূলবর্তী ও মেঘনা নদীর তীরবর্তী অনেক জানা-অজানা প্রসিদ্ধ জনপদ ও শহর-বন্দর ইবনে বতুতার বর্ণনায় যার উল্লেখ আছে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Chattogram");
        hashMap.put("policeCall","Chattogram");
        hashMap.put("policeStationName","Chattogram Police Station");
        hashMap.put("history","সীতাকুন্ড এলাকায় পাওয়া প্রস্তরীভূত অস্ত্র এবং বিভিন্ন মানবসৃষ্ট প্রস্তর খন্ড থেকে ধারণা করা হয় যে, এ অঞ্চলে নব্যপ্রস্তর যুগে অস্ট্রো-এশিয়াটিক জনগোষ্ঠীরবসবাস ছিল। তবে, অচিরে মঙ্গোলদের দ্বারা তারা বিতাড়িত হয় (হাজার বছরের চট্টগ্রাম, পৃ\u200C২৩)। লিখিত ইতিহাসে সম্ভবত প্রথম উল্লেখ গ্রিক ভৌগোলিক প্লিনির লিখিত পেরিপ্লাস। সেখানে ক্রিস নামে যে স্থানের বর্ণনা রয়েছে ঐতিহাসিক নলিনীকান্ত ভট্টশালীর মতে সেটি বর্তমানের সন্দীপ। ঐতিহাসিক ল্যাসেনের ধারণা সেখানে উল্লিখিত পেন্টাপোলিশ আসলে চট্টগ্রামেরই আদিনাম। মৌর্য সাম্রাজ্যের সঙ্গে যোগাযোগের বিষয়টি নিশ্চিত নয় তবে পূর্ব নোয়াখালির শিলুয়াতে মৌর্য যুগেরব্রাহ্মী লিপিতে একটি মূর্তির পাদলিপি পাওয়া গেছে। তিব্বতের বৌদ্ধ ঐতিহাসিক লামা তারানাথের একটি গ্রন্থে চন্দ্রবংশের শাসনামলের কথা দেখা যায় যার রাজধানী ছিল চট্টগ্রাম। এর উল্লেখ আরাকানের সিথাং মন্দিরের শিলালিপিতেও আছে। তারানাথের গ্রন্থে দশম শতকে গোপীনাথ চন্দ্র নামের রাজার কথা রয়েছে (বাংলাপিডিয়া, খন্ড ৩, পৃ২৭৬)। সে সময় আরবীয় বনিকদের চট্টগ্রামে আগমন ঘটে। আরব ভৌগলিকদের বর্ণনার ‘সমুন্দর’ নামের বন্দরটি যে আসলে চট্টগ্রাম বন্দর তা নিয়ে এখন ঐতিহাসিকরা মোটামুটি নিশ্চিত (হাজার বছরের চট্টগ্রাম, পৃ\u200C২৩)। সে সময় পালবংশের রাজা ছিলেন ধর্মপাল। পাল বংশের পর এ অঞ্চলে একাধিক ক্ষুদ্র ক্ষুদ্র রাজ্যের সৃষ্টি হয়।\n" +
                "\n" +
                "৯৫৩ সালে আরাকানের চন্দ্রবংশীয় রাজা সু-লা\u200C-তাইং-সন্দয়া চট্টগ্রাম অভিযানে আসলেও কোন এক অজ্ঞাত কারণে তিনি বেশি দূর অগ্রসর না হয়ে একটি স্তম্ভ তৈরি করেন। এটির গায়ে লেখা হয় ‘চেৎ-ত-গৌঙ্গ’ যার অর্থ ‘যুদ্ধ করা অনুচিৎ’। সে থেকে এ এলাকাটি চৈত্তগৌং হয়ে যায় বলে লেখা হয়েছে আরাকানীয় পুথি ‘রাজাওয়াং’-এ। এ চৈত্তগৌং থেকে কালক্রমে চাটিগ্রাম, চাটগাঁ, চট্টগ্রাম, চিটাগাং ইত্যাদি বানানের চল হয়েছে (হাজার বছরের চট্টগ্রাম, পৃ\u200C২৩)। চন্দ্রবংশের পর লালবংশ এবং এরপর কয়েকজন রাজার কথা কিছু ঐতিহাসিক উল্লেখ করলেও ঐতিহাসিক শিহাবুদ্দিন তালিশের মতে ১৩৩৮ সালে সুলতান ফকরুদ্দিন মোবারক শাহ এর চট্টগ্রাম বিজয়ের আগ পর্যন্ত ইতিহাস অস্পষ্ট। এ বিজয়ের ফলে চট্টগ্রাম স্বাধীন সোনারগাঁও রাজ্যের অন্তর্ভুক্ত হয়। সে সময়ে প্রায় ১৩৪৬ খ্রিস্টাব্দে চট্টগ্রাম আসেন বিখ্যাত মুর পরিব্রাজক ইবনে বতুতা। তিনি লিখেছেন -“বাংলাদেশের যে শহরে আমরা প্রবেশ করলাম তা হল সোদকাওয়াঙ (চট্টগ্রাম)। এটি মহাসমূদ্রের তীরে অবস্থিত একটি বিরাট শহর, এরই কাছে গঙ্গা নদী- যেখানে হিন্দুরা তীর্থ করেন এবং যমুনা নদী একসঙ্গে মিলেছে এবং সেখান থেকে প্রবাহিত হয়ে তারা সমুদ্রে পড়েছে। গঙ্গা নদীর তীরে অসংখ্য জাহাজ ছিল, সেইগুলি দিয়ে তারা লখনৌতির লোকেদের সঙ্গে যুদ্ধ করে। ...আমি সোদওয়াঙ ত্যাগ করে কামরু (কামরূপ) পর্বতমালার দিকে রওনা হলাম।” ১৩৫২\u200C-৫৩ সালে ফকরুদ্দীন মোবারক শাহ এর পুত্র ইখতিয়ার উদ্দিন গাজী শাহকে হত্যা করে বাংলার প্রথম স্বাধীন সুলতান ইলিয়াস শাহ বাংলার মসনদ দখল করলে চট্টগ্রামও তার করতলগত হয়। তার সময়ে চট্টগ্রাম বাংলার প্রধান বন্দর হিসাবে প্রতিষ্ঠিত হয়। এর পর হিন্দুরাজা গণেশ ও তার বংশধররা চট্টগ্রাম শাসন করে। এরপরে বাংলায় হাবসি বংশ প্রতিষ্ঠা হয়। কিন্তু ১৪৯২ সালে সুলতান হোসেন শাহ বাংলার সুলতান হোন। কিন্তু চট্টগ্রামের দখল নিয়ে তাকে ১৪১৩-১৪১৭ সাল পর্যন্ত ত্রিপুরার রাজা ধনমানিক্যের সঙ্গে যুদ্ধে লিপ্ত থাকতে হয়েছে। তবে শেষ পর্যন্ত রাজা ধনমানিক্যের মৃত্যুর পর হোসেন শাহ-এর রাজত্ব উত্তর আরাকান পর্যন্ত বিস্তৃত হয়। তার সময়ে উত্তর চট্টগ্রামের নায়েব পরবগল খানের পুত্র ছুটি খাঁর পৃষ্ঠপোষকতায় শ্রীকর নন্দীমহাভারতের একটি পর্বের বঙ্গানুবাদ করেন।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Coxsbazar");
        hashMap.put("policeCall","Coxsbazar");
        hashMap.put("policeStationName","Coxsbazar Police Station");
        hashMap.put("history","কক্সবাজার নামকরণের পেছনে রয়েছে ছোট্ট একটা ইতিহাস। এর প্রাচীন নাম ছিল পালংকী। একসময় এটি প্যানোয়া নামে পরিচিত ছিল। প্যানোয়া শব্দটির অর্থ ‘হলুদ ফুল’।অতীতে কক্সবাজারের আশপাশের এলাকাগুলো এই হলুদ ফুলে ঝকমক করত। এটি চট্টগ্রাম থেকে ১৫৯ কিলোমিটার দক্ষিণে অবস্থিত।  আধুনিক কক্সবাজারের নামকরণ করা হয়েছে প্রখ্যাত বিট্রিশ নৌ-অফিসার ক্যাপ্টেন হিরাম কক্স (মৃত্যু-১৭৯৮) এর নামানুসারে। যিনি ব্রিটিশ ইন্ডিয়ার আর্মি অফিসার ছিলেন।\n" +
                "\n" +
                "ইতিহাসঃ\n" +
                "\n" +
                "কক্সবাজারের ইতিহাস মুঘল আমলে শুরু হয়েছে। বর্তমান কক্সবাজারের পাশ দিয়ে মুঘল শাসন কর্তা প্রিন্স শাহ সুজা আরাকান প্রদেশে যাওয়ার পথে এ অঞ্চলের পাহাড় ও সাগরের মিলিত সৌন্দর্য অবলোকন করে মুগ্ধ হয়ে যান। তিনি তার সেনা-সামন্তকে এখানে ঘাঁটি করতে বলেন। সঙ্গে সঙ্গে তাঁর সেনা বহরের  এক হাজার পালকি (ঢুলি) এখানে অবস্থান নেয়। এক হাজার ঢুলি (পালকি) এর নামে এর নামকরণও করা হয় ডুলাহাজারা যা বর্তমানে চকরিয়া উপজেলার একটি ইউনিয়ন। মুঘল আমলের পরবর্তীতে এ অঞ্চল ত্রিপুরা এবং আরাকানদের দখলে চলে যায়। তারপর পর্তুগীজরা কিছু সময় এ অঞ্চলে শাসন করে। অত:পর ইস্ট-ইন্ডিয়া কোম্পানীর ক্যাপ্টেন হিরাম কক্স কে এ অঞ্চলের দায়িত্বভার দেয়া হয়। তিনি এখানে একটি বাজার প্রতিষ্ঠা করেন। যা ‘কক্স সাহেবের বাজার’ এবং পরবর্তীতে কক্সবাজার নামে পরিচিত পায়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Khagrachhari");
        hashMap.put("policeCall","Khagrachhari");
        hashMap.put("policeStationName","Khagrachhari Police Station");
        hashMap.put("history","খাগড়াছড়ির ঐতিহাসিক পটভূমিঃ  ইতিহাস পর্যালোচনায় জানা যায়, খ্রিষ্টীয় ষষ্ঠ শতাব্দী থেকে চতুর্দশ শতাব্দী পর্যন্ত অত্র এলাকাটি কখনো ত্রিপুরা, কখনো বা আরকান রাজন্যবর্গ দ্বারা শাসিত হয়েছে। তন্মধ্যে ৫৯০ হতে ৯৫৩ খ্রিষ্টাব্দ পর্যন্ত মোট ৩৬৩ বছর ধরে ত্রিপুরা রাজাগণ বংশপরম্পরায় পার্বত্য চট্টগ্রাম (খাগড়াছড়িসহ) ও চট্টগ্রাম শাসন করে। অতঃপর ৯৫৩ খ্রিষ্টাব্দ হতে ১২৪০ খ্রিষ্টাব্দ পর্যন্ত আরকান রাজাগণ ২৯৭ বছরব্যাপী এ এলাকা শাসন করলেও তদ্পরবর্তীতে ১০২ বছরব্যাপী (১৩৪২ খ্রিষ্টাব্দ পর্যন্ত) পুনরায় ত্রিপুরা রাজাগণ এ এলাকার কর্তৃত্ব করেন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "ইতিহাসসূত্রে জানা যায় দশম শতাব্দী থেকে পঞ্চদশ শতাব্দী পর্যন্ত ত্রিপুরা রাজাগণ ০৮ (আট) বার, আরাকান রাজাগণ ০৯ (নয়) বার এবং গৌড়ের সুলতানগণ (মুসলিম) ০৬ (ছয়) বার এ এলাকাটি দখলে নেন। অবশেষে ১৩৪২ খ্রিষ্টাব্দ হতে ত্রিপুরা রাজার শাসন ক্ষমতার আওতা হতে মুসলিম শাসক সুলতান ফকরুদ্দিন মোবারক শাহ্ চট্টগ্রামসহ এ এলাকার নিয়ন্ত্রণ নেন। মুসলিম শাসনের ধারাবাহিকতায় ১৭৫৭ খ্রিষ্টাব্দে ইষ্ট ইন্ডিয়া কোম্পানী কর্তৃক বাংলার মসনদ দখল পরবর্তীকালে নবাব মীর কাশিম আলী খানের রাজত্বকালে ১৭৬০ খ্রিষ্টাব্দে ব্রিটিশ সরকার নবাব মীর কাশিমের করতল থেকে চট্টগ্রাম অধিকার করেন। অতঃপর ১৭৬১ খ্রিষ্টাব্দে ১৪ ফেব্রুয়ারী ব্রিটিশ সরকারের সাথে স্বাধীন ত্রিপুরা মহারাজার যুদ্ধ সংঘটিত হয়। যুদ্ধে ত্রিপুরা রাজার পরাজয়ের প্রেক্ষিতে উভয়ের মধ্যে এক চুক্তি সম্পাদিত হয়। উক্ত চুক্তির ‘৩’ নম্বর ধারা অনুসারে ‘‘চট্টগ্রাম পার্বত্য অঞ্চলের রাজস্ব ও প্রশাসনিক নির্বাহী ক্ষমতা ইংরেজ সরকারের হাতে ন্যস্ত থাকবে’’ বলে উল্লেখ থাকায় প্রকৃতপক্ষে তখন থেকে পার্বত্য চট্টগ্রাম ত্রিপুরা মহারাজার শাসন ক্ষমতা ও ত্রিপুরা রাজ্য হতে বিচ্ছিন্ন হয়ে যায়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Bandarban");
        hashMap.put("policeCall","Bandarban");
        hashMap.put("policeStationName","Bandarban Police Station");
        hashMap.put("history","বান্দারবান জেলার নামকরণের ইতিহাস\n" +
                "\n" +
                "বান্দরবান জেলার নামকরণ নিয়ে একটি কিংবদন্তি রয়েছে। এলাকার বাসিন্দাদের প্রচলিত রূপ কথায়  আছে অত্র এলাকায়  একসময় বাস করত অসংখ্য বানর । আর এই বানরগুলো  শহরের প্রবেশ মুখে  ছড়ার  পাড়ে পাহাড়ে প্রতিনিয়ত লবণ  খেতে আসত। এক সময় অনবরত বৃষ্টির কারণে ছড়ার পানি বৃ্দ্ধি পাওয়ায় বানরের দল ছড়া পাড় হয়ে পাহাড়ে যেতে না পারায়  একে অপরকে ধরে ধরে সারিবদ্ধভাবে ছড়া পাড় হয়। বানরের ছড়া পারাপারের এই দৃশ্য দেখতে পায় এই জনপদের মানুষ।  এই সময় থেকে এই জায়গাটির পরিচিতি লাভ করে \"ম্যাঅকছি ছড়া \" হিসাবে । অর্থ্যাৎ মার্মা ভাষায় ম্যাঅক অর্থ  বানর  আর ছিঃ অর্থ বাঁধ । কালের প্রবাহে বাংলা ভাষাভাষির সাধারণ উচ্চারণে এই এলাকার নাম রুপ লাভ করে বান্দরবান হিসাবে ।  বর্তমানে সরকারি দলিল পত্রে বান্দরবান হিসাবে এই জেলার নাম স্থায়ী রুপ লাভ করেছে। তবে মার্মা ভাষায় বান্দরবানের প্রকৃত নাম \"রদ ক্যওচি ম্রো\"।\n" +
                "\n" +
                "জেলা রূপে আবির্ভাব\n" +
                "\n" +
                "বৃটিশ শাসন আমলে ১৮৬০ সালে পার্বত্য চট্টগ্রামকে জেলা ঘোষণা করা হয়। তৎকালীন সময়ে বান্দরবান পার্বত্য চট্টগ্রাম জেলার অধীন ছিলো। ক্যাপ্টেন মাগ্রেথ ছিলেন পার্বত্য চট্টগ্রাম জেলার প্রথম সুপারিনট্যানডেন্ট। ১৮৬৭ সালে পার্বত্য চট্টগ্রাম জেলার সুপারিনট্যানডেন্ট পদটির কার্যক্রম আরও বিস্তৃত করা হয় এবং ১৮৬৭ সালে এই পদটির নামকরণ করা হয় ডেপুটি কমিশনার। পার্বত্য চট্ট্রগাম জেলার প্রথাম ডেপুটি কমিশনার ছিলেন টি, এইচ লুইন। ১৯০০ সালের পার্বত্য চট্টগ্রাম রেগুলেশন অনুসারে পার্বত্য চট্টগ্রামকে তিনটি সার্কেলে বিভক্ত করা হয়-চাকমা সার্কেল, মং সার্কেল, এবং বোমাং সার্কেল। প্রত্যেক সার্কেলের জন্য একজন সার্কেল চীফ নিযুক্ত ছিলেন। বান্দরবান তৎকালীন সময়ে বোমাং সার্কেলের অর্ন্তভুক্ত ছিলো। বোমাং সার্কেলের অন্তর্ভূক্ত হওয়ার কারণে এই জেলার আদি নাম বোমাং থং।\n" +
                "\n" +
                " \n" +
                "বান্দরবান জেলা ১৯৫১ সালে মহকুমা হিসেবে প্রশাসনিক কার্যক্রম শুরু করে। এটি রাংগামাটি জেলার প্রশাসনিক ইউনিট ছিলো। পরর্বতীতে ১৯৮১ সালের ১৮ই এপ্রিল, তৎকালিন লামা মহকুমার ভৌগলিক ও প্রশাসনিক সীমানাসহ সাতটি উপজেলার সমন্বয়ে বান্দরবান পার্বত্য জেলা হিসাবে আত্মপ্রকাশ করে।");
        arrayList.add(hashMap);
    }
}