package com.rafsan.hellopolice;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.text.TextUtils;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.GridView;
import android.widget.ImageView;
import android.widget.TextView;

import org.w3c.dom.Text;

import java.util.ArrayList;
import java.util.HashMap;

import soup.neumorphism.NeumorphCardView;

public class RajshahiDiv extends AppCompatActivity {

    TextView textMarque,callNumber1,callNumber2,callNumber3;

    ImageView callButton1,callButton2,callButton3;

    GridView rajshahiGridView;

    ArrayList<HashMap<String,String>> arrayList = new ArrayList<>();
    HashMap<String,String> hashMap;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_rajshahi_div);

        textMarque = findViewById(R.id.textMarque);
        textMarque.setEllipsize(TextUtils.TruncateAt.MARQUEE);
        textMarque.setSelected(true);

        //==============================================
        //==============================================
        callNumber1 = findViewById(R.id.callNumber1);
        callNumber2 = findViewById(R.id.callNumber2);
        callNumber3 = findViewById(R.id.callNumber3);

        callButton1 = findViewById(R.id.callButton1);
        callButton2 = findViewById(R.id.callButton2);
        callButton3 = findViewById(R.id.callButton3);

        callButton1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber1.getText().toString();
                Intent myIntent = new Intent(Intent.ACTION_CALL);
                myIntent.setData(Uri.parse("tel:"+number));
                startActivity(myIntent);
            }
        });
        callButton2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber2.getText().toString();
                startActivity(new Intent(Intent.ACTION_CALL,Uri.parse("tel:"+number)));
            }
        });

        callButton3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String number = callNumber3.getText().toString();
                startActivity(new Intent(Intent.ACTION_CALL,Uri.parse("tel:"+number)));
            }
        });
        //==============================================
        //==============================================

        rajshahiGridView = findViewById(R.id.rajshahiGridView);

        rajshahiDisTable();

        MyRajshahi myRajshahi =new MyRajshahi();
        rajshahiGridView.setAdapter(myRajshahi);

    }

    private class MyRajshahi extends BaseAdapter{

        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int position) {
            return null;
        }

        @Override
        public long getItemId(int position) {
            return 0;
        }

        @Override
        public View getView(int position, View convertView, ViewGroup parent) {
            LayoutInflater layoutInflater = getLayoutInflater();
            View myView = layoutInflater.inflate(R.layout.districts_list,parent,false);

            TextView textDistrict = myView.findViewById(R.id.textDistrict);
            NeumorphCardView disCardView = myView.findViewById(R.id.disCardView);

            HashMap<String,String> hashMap1 = arrayList.get(position);

            String districtName = hashMap1.get("districtName");
            textDistrict.setText(districtName);

            String policeCall = hashMap1.get("policeCall");
            String history = hashMap1.get("history");
            String policeStationName = hashMap1.get("policeStationName");

            disCardView.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {
                    if (districtName.contains("Sirajganj")){

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));
                    }
                    else if (districtName.contains("Pabna")) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));
                    }
                    else if (districtName.contains("Bogura")) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));
                    }
                    else if ( districtName.contains("Rajshahi") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));

                    }else if ( districtName.contains("Natore") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));

                    }else if ( districtName.contains("Joypurhat") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));

                    }else if ( districtName.contains("Chapainawabganj") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));

                    }else if ( districtName.contains("Naogaon") ) {

                        PoliceInformationDetail.POLICE_Number = policeCall;
                        PoliceInformationDetail.HISTORY = history;
                        PoliceInformationDetail.POLICE_STATION_NAME = policeStationName;

                        startActivity(new Intent(RajshahiDiv.this, PoliceInformationDetail.class));

                    }
                }
            });

            return myView;
        }
    }

    private void rajshahiDisTable(){

        hashMap = new HashMap<>();
        hashMap.put("districtName","Sirajganj");
        hashMap.put("policeCall","01320-129590");
        hashMap.put("policeStationName","Sirajganj Police Station");
        hashMap.put("history","প্রাচীন কাল\n" +
                "\n" +
                "সপ্তম শতাব্দীর পর থেকেই ময়মনসিংহের দক্ষিণ-পশ্চিম অঞ্চল অর্থাৎ সিরাজগঞ্জ, জামালপুর, টাঙ্গাইল, গাজীপুর, ফরিদপুর বছরের প্রায় আট/নয় মাস পানির নিচে থাকতো। ফলে জনবসতি ছিল কম। এ অঞ্চল থেকে পানি সাগরের দিকে নেমে গেলে বছরের চার পাঁচ মাস সময়ে পাশ্ববর্তী কায়েম অঞ্চল থেকে লোকজন আবাদ বসত চালু রাখার জন্য ভীড় জমাতো। সেই শুকনো মৌসুমে কতিপয় মেহনতি মানুষ একতাবদ্ধ হয়ে পরবর্তী বছরে প্লাবনের হাত থেকে রেহাই পাওয়ার জন্য জাংগাল (বাঁধ) তৈরী করত। ফলে জাংগালের মধ্যকার জলাভূমি কিছুকালের মধ্যেই কায়েমী অঞ্চলের আকার ধারণ করত। ধারণা করা হয় সমূদ্রতট থেকে সমতট শব্দটির উৎপত্তি। চৈনিক পরিব্রাজক হিউয়েন সাং এর সঙ্গে প্রায়ই ঐক্যমতে ডাঃ কালিদাস নাগ, পিএইচডি তদানিন্তন বঙ্গের পূর্বের নিম্নাঞ্চলকে অর্থাৎ পূর্ব বঙ্গের প্রায় অংশকেই সমতট বলে আখ্যা দিয়েছেন। ময়মনসিংহের অধিকাংশ এলাকাই এই সমতটের অন্তর্গত সমতল ভূমি। শশাঙ্ক ৬১৯ খৃষ্টাব্দ পর্যন্ত বঙ্গদেশে রাজত্ব করেন, জ্ঞান সমগ্র আর্য্যবর্তে বাঙ্গালীদের সম্রাজ্য স্থাপনের স্বপ্ন দেখেন এবং আংশিক সে স্বপ্নকে সফল করেন (R.C. Mojuccedu Bangladesher Itihash-P-31)। পরবর্তী যুগে বাঙ্গালী বংশোদ্ভুত শেরশাহের পুত্র সলিম শাহ শের শাহের মৃত্যুর পর জালাল উদ্দিন খাঁ সলিম শাহ নাম ধারণ পূর্বক দিল্লীর মসনদে আরোহন করেন। তিনিই একমাত্র বাঙালী যিনি দিল্লির মসনদে শেরশাহের পুত্র রূপে আরোহণ করে আট বৎসর রাজত্ব করেন (১৫৪৫-১৫৫৩ খৃঃ)। তিনি পাবনা জেলার চাইমোহর থানার অন্তর্গত সমাজ নামক গ্রামে জন্মলাভ করেন ও প্রতিপালিত হন এবং পরে দিল্লী গমন করে পিতার সহিত মিলিত হন ও শাহী মসনদে আরোহন করেন। পাল রাজাগণের সময় এ অঞ্চলের শাসকদের লাট, চাট, ভাট ইত্যাদি পদ দেয়া হত। সম্ভবত এই ভাট হইতেই বঙ্গদেশের যমুনা নদীর ও রাজমহলের নিম্নেদেশ - পাবনা ও ফরিদপুর অঞ্চল ভাটের দেশ বলে পরিচিত। পাবনা জেলা ও তৎকালে সিরাজগঞ্জ মহকুমায় যে বিরাট চলনবিলের অস্তিত্ব বর্তমান তা দৃষ্টে ও পাবনা জেলার ইতিহাস (রাধা রমন সাহা-১-৩ খন্ড), অধ্যাপক আব্দুল হামিদ এর চলনবিলের ইতিকথা ও প্রমথবিশীর চলনবিল গ্রন্থে যে ঐতিহাসিক বর্ণনা বিভিন্ন ভাবে পাওয়া যায়, তৎসঙ্গে হজরত শাহ জালাল (রঃ) জীবনী গ্রন্থ (কৃত চৌধুরী গোলাম আকবর) এর খন্দকার আব্দুর রহিম সাহেবের টাঙ্গাইলের ইতিহাস এবং করটিয়া খান পন্নী সাহেবের নিজস্ব ইতিহাস পাঠে জানা যায় যে রাজমহল পাহাড় হতে টাঙ্গাইলের দক্ষিণে আটিয়া গ্রামের পশ্চিম পাশের লৌহজং নদী পর্যন্ত বিশাল জলধিতল ছিল (আটিয়া শাহী মসজিদ লৌহজং নদীর পূর্বতীরে প্রতিষ্ঠাকাল ১৬০৯)। সম্রাট আকবরের রাজত্ব কালে কাগমারীর দরবেশ হযরত শাহ জালাল (রঃ) এবং তার মামা শাহানশাহ হযরত বাবা আদম (রঃ) কাশ্মিরী এ অঞ্চলে আগমন ও ইসলাম প্রচার করেন। তাঁদের জীবনীতেই বিশাল জলধির মধ্যে চর জাতীয় প্রাচীন ভূমির উল্লেখ পাওয়া যায়। অনুরূপভাবে শাহজাদপুরে হযরত শাহদৌলা মখদুম (রঃ) সিরাজগঞ্জে হযরত শাহ সিরাজউদ্দিন, নওগাঁতে দাদাপীর, রাজশাহী জেলার বাঘাতে শাহাদৌলা জামী দানেশমন্দ (রঃ) এবং চর মধ্যাহ্ন দ্বীপে বারুহাস ইমামবাড়ী পীর সাহেবের আগমন ঘটে।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Pabna");
        hashMap.put("policeCall","01320-128500");
        hashMap.put("policeStationName","Pabna Police Station");
        hashMap.put("history","‘পাবনা’ নামকরণ নিয়ে কিংবদন্তির অন্ত নেই। এক কিংবদন্তি মতে গঙ্গার ‘পাবনী’ নামক পূর্বগামিনী ধারা হতে পাবনা নামের উৎপত্তি হয়েছে। অপর একটি সূত্রে জানা যায় ‘পাবন’ বা ‘পাবনা’ নামের একজন দস্যুর আড্ডাস্থলই এক সময় পাবনা নামে পরিচিতি লাভ করে। অপরদিকে কিছু ঐতিহাসিক মনে করেন, ‘পাবনা’ নাম এসেছে ‘পদুম্বা’ থেকে। কালক্রমে পদুম্বাই স্বরসঙ্গতি রক্ষা করতে গিয়ে বা শব্দগত অন্য ব্যুৎপত্তি হয়ে পাবনা হয়েছে। ‘পদুম্বা’ জনপদের প্রথম সাক্ষাৎ মিলে খ্রিষ্টীয় একাদশ শতকে পাল নৃপতি রামপালের শাসনকালে। ইতিহাসে উল্লেখ আছে, রামপাল হ্নতরাজ্য বরেন্দ্র কৈবর্ত শাসকদের নিকট থেকে পুনরুদ্ধারের জন্য যে চৌদ্দজন সাহায্যকারীর শরণাপন্ন হয়েছিলেন -এঁদেরই একজন ছিলেন পদুম্বার সোম নামক জনৈক সামন্ত। আবার অনেকের মতে পৌন্ড্রবর্ধন হতে পাবনা নামের উৎপত্তি হয়েছে। তাঁরা বলেন পৌন্ড্রবর্ধনের বহু জনপদ গঙ্গার উত্তর দিকে অবস্থিত ছিল। চলতি ভাষায় পুন্ড্রুবর্ধন বা পৌন্ড্রবর্ধন পোনবর্ধন বা পোবাবর্ধন রূপে উচ্চারিত হতে হতে পাবনা হয়েছে।\n" +
                "\n" +
                "সাবেক পাবনা (সিরাজগঞ্জ জেলাসহ) জেলা রূপে গঠিত এলাকাটি প্রাচীন যুগে পূর্ব ভারতের বঙ্গ ও পুন্ড্রুবর্ধন জনপদের অংশ ছিল। গঙ্গারিডির রাজত্বের অবসানের পর বৃহত্তর পাবনা মৌর্য সাম্রাজ্যভুক্ত হয়। রাজা অশোক পুন্ডুসহ সমগ্র বাঙলা নিজ শাসনাধীনে এনেছিলেন। জেলাটির প্রায় সম্পূর্ণই মৌর্য সাম্রাজ্যের অন্তর্ভূক্ত ছিল। মৌর্য বংশের পতনের পর পাবনা জেলাসহ বাংলার এ অঞ্চলের রাজনৈতিক অবস্থার ইতিহাস অজ্ঞতার অন্ধকারে চাপা পড়ে যায়। এ অঞ্চল সমুদ্রগুপ্তের সময়ে (৩৪০-৩৮০ খ্রিষ্টাব্দ) গুপ্ত সম্রাজ্যের অন্তর্ভুক্ত হয়েছিল এবং প্রথম কুমার গুপ্তের (৪১৩-৪৫৫ খ্রিষ্টাব্দ) শাসনামলে পাবনা (সিরাজগঞ্জসহ) জেলা উত্তর বাংলার পুন্ড্রবর্ধন ভুক্তি নামে গুপ্ত সাম্রাজ্যের একটি গুরুত্বপূর্ণ প্রশাসনিক বিভাগে পরিণত হয়েছিল। গুপ্ত রাজাদের পতনের পর এই অঞ্চল খুব সম্ভবতঃ পরবর্তী গুপ্তদের অধীনে মহাসেন গুপ্তের রাজত্বকাল পর্যন্ত শাসিত হয়েছিল। তিনি ৬ষ্ঠ শতকের শেষের দিকে বাংলার এ অংশে রাজত্ব করেছিলেন। সপ্তম শতকের প্রারম্ভে শশাংক পরবর্তী গুপ্তদের উচ্ছেদ সাধনে সাফল্য অর্জন করেন। তিনি উত্তর ও পশ্চিম বাংলা এবং মগধ নিয়ে গৌড় রাজ্য নামেএকটি স্বাধীন শক্তিশালী রাজ্য স্থাপন করেন। ৬৩৭ খ্রিঃ শশাংকের মৃত্যুর পর হর্ষবর্ধন এই অঞ্চলের উপর কর্তৃত্ব স্থাপন করতে সক্ষম হন। এ সময়ে ৬৩৮ খ্রিষ্টাব্দে চীন দেশীয় পরিব্রাজক হিউয়েন সাং বাংলাদেশ পরিভ্রমণে আসেন। হর্ষবর্ধনের মৃত্যুর পর প্রাচীন বাংলার এ অংশের প্রায় দেড়শত বছরের ইতিহাস অজানার অন্ধকারে ঢাকা পড়ে আছে। এ সময়ে (৬০০-৭৫০ খ্রিঃ) বাংলায় রাজনৈতিক গোলযোগ ও বিশৃঙ্খলা দেখা দিয়েছিল। কেন্দ্রে কোন শাসন ছিলনা। এক চরম অরাজক অবস্থা। ইতিহাসে এ সময়কে মাৎস্যন্যায় বলে আখ্যায়িত করা হয়েছে। অষ্টম শতকের প্রারম্ভে ৭২৩ এবং ৭৩৫ খ্রিষ্টাব্দের মধ্যে কোন এক সময়ে কনৌজের যশোবর্ধন গৌড়রাজকে পরাজিত করে বাংলাদেশ দখল করেন এবং পাবনা জেলাসহ প্রায় সমগ্র বাংলা তাঁর হস্তগত হয়। ৭৩৬ খ্রিষ্টাব্দে কাশ্মীরের ললিতাদিত্য যলোবর্ধনকে পরাজিত করে এ অঞ্চলের উর প্রভুত্ব বিস্তার করে। পরবর্তীকালে পাবনা পালদের অধীনে এসে যায়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Bogura");
        hashMap.put("policeCall","01713374061");
        hashMap.put("policeStationName","Bogura Police Station");
        hashMap.put("history","সুলতান গিয়াস উদ্দিন বলবনের পুত্র সুলতান নাসির উদ্দিন বগড়াগণ ১২৭৯ থেকে ১২৮২ পর্যন্ত এ অঞ্চলের শাসক ছিলেন। তার নামানুসারে এ অঞ্চলের নাম হয়েছে বগড়া বা বগুড়া। বগুড়া  বাংলাদেশের উত্তরাঞ্চলের একটি  জেলা। ইহা রাজশাহী বিভাগের অন্তর্গত। বগুড়াকে উত্তরাঞ্চলের প্রবেশদ্বার বলা হয়। ইহা শিল্পের শহর নামে পরিচিত। এখানে ছোট এবং মাঝারি ধরনের শিল্প কারখানা রয়েছে। বগুড়া  জেলায় প্রাচীন সভ্যতার ইতিহাস রয়েছে। বগুড়া  জেলার মধ্যে বাঙ্গালী, করতোয়া, যমুনা ও নাগর নদী উল্লেখযোগ্য।\n" +
                "\n" +
                "এ জেলায় মহাসড়কের দু’পাশে অবস্থান করছে প্রকৃতির অপরূপ সাজে সজ্জিত গ্রামগুলো। খাদ্য শস্য ও শাকসবজি উৎপাদনের ভান্ডার হিসেবে খ্যাত। এ জনপদের জনসাধারণের বহুদিনের আশা-আকাংখার প্রতিক শহীদ জিয়াউর রহমান মেডিকেল কলেজ ও হাসপাতাল, শহীদ চাঁন্দু আমত্মর্জাতিক ক্রিকেট ষ্টেডিয়াম, জাতীয় কম্পিউটার প্রশিক্ষণ ও গবেষণা একাডেমী, এশিয়া মহাদেশের সর্ববৃহৎ অন্যতম নারী সংগঠন পরবর্তীতে এনজিও হিসাবে পরিচিত ঠেঙ্গামারা মহিলা সবুজ সংঘ ( টিএমএসএস) এর সদর দপ্তর এ উপজেলার মধ্যে অবস্থিত। এছাড়া, গোকুল ইউনিয়নে মেধ নামক স্থানে ঐতিহাসিক বেহুলা - লক্ষিনদরের বাসর ঘর, চাঁদমুহা হরিপুর-সাহার বিল এলাকায় চাঁদ সওদাগরের বসতবাড়ি, নামুজা ইউনিয়নের চিংগাসপুরে পদ্মাদেবীর বাড়ি, লাহিড়ীপাড়া ইউনিয়নের রায়-মাঝিড়ায় কালু গাজীর কোর্ট এবং নুনগোলা ইউনিয়নের হাজরাদিঘী এবতেদায়ী মাদ্রাসা সংলগ্ন সাপের ওঝাঁ ধনমত্মরীর বাড়ি অবস্থিত। উপজেলার প্রাণকেন্দ্র সাতমাথায় সার্কিট হাউজ সংলগ্ন নবাববাড়ি যা বর্তমানে প্যালেস মিউজিয়াম ও কারুপলস্নী নামে বহুল পরিচিত। ঐতিহাসিক আলতাফুন্নেছা খেলার মাঠ ও বগুড়ার উডবার্ন পাবলিক লাইব্রেরি যা ১৮৫৪ সালে স্থাপিত হয়েছে। উডবার্ন পাবলিক লাইব্রেরি সংলগ্ন স্থানে বৃটেনের রাজ পরিবারের সদস্য এ্যাডওয়ার্ড সপ্তম জজ এর একটি প্রাচীন ভাস্কর রয়েছে। বগুড়া শহরের প্রাণকেন্দ্র সাতমাথায় বাংলাদেশের স্বাধীনতা যুদ্ধে শাহাদৎ বরণকারি দেশের সর্বকালের সর্বশ্রেষ্ট ৭জন বীরশ্রেষ্ট সমত্মানের স্মৃতিসত্মম্ভ স্থাপনা উলেস্নখ্যযোগ্য। উত্তরবঙ্গে সর্বপ্রথম আমত্মর্জাতিক মানের চার তারাকা হোটেল নাজ গার্ডেন এবং শিশুদের চিত্তবিনোদনের স্থান ওয়ান্ডারল্যান্ড পার্ক সদর উপজেলাতেই অবস্থিত। এ উপজেলায় তদানিমত্মন পাকিসত্মানের প্রধানমন্ত্রী জনাব সৈয়দ মোহাম্মদ আলী চৌধূরী, বিশিষ্ট সাহিত্যিক রোমেনা আফাজ, এম.আর আকতার মুকুল, বি.এম ইলিয়াস, ভাষা সৈনিক গাজীউল হক, পলস্নী কবি রোসত্মম আলী কর্ণপুরী, কণ্ঠশিল্পি আঞ্জুমান আরা জম্ম গ্রহণ করেছেন।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Rajshahi");
        hashMap.put("policeCall","01320-123499");
        hashMap.put("policeStationName","Rajshahi Police Station");
        hashMap.put("history","রাজশাহী নামটির উৎপত্তি সম্পর্কে আলোচনা করতে গেলেই কয়েক শতাব্দী পূর্বে ফিরে যেতে হয়। এ শহরের প্রাচীন নামটি ছিল মহাকাল গড়।পরে রূপান্তরিত হয়ে দাঁড়ায় রামপুর-বোয়ালিয়ায়।\n" +
                "\n" +
                "\n" +
                "রামপুর-বোয়ালিয়া থেকে রাজশাহী নামটির উদ্ভব কিভাবে হলো এর সুস্পষ্ট কোন ব্যাখ্যা নাই । ব্রিটিশ আমলের প্রাথমিক যুগের ইতিহাসে ও রাজশাহী নামক কোন জনপদ বা স্থানের উল্লেখ নাই । অনেকে মনে করেন, এই জনপদ একদা বহু হিন্দু, মুসলিম, রাজা, সুলতান আর জমিদার শাসিত ছিল বলে নামকরণ হয়েছে রাজশাহী।\n" +
                "ঐতিহাসিক ব্লকম্যানের (Bolch Mann) মতে, খ্রিষ্টীয় ১৫শ শতকে গৌড়ের মুসলিম সালতানাত এই জেলার ভাতুড়িয়ার জমিদার রাজা গণেশ কতৃর্ক আত্মসাতের সময় থেকে রাজশাহী নামের উদ্ভব হয়েছে। হিন্দু রাজ আর ফারসী শাহী এই শব্দ দুটির সমন্বয়ে উদ্ভব হয়েছে মিশ্রজাত শব্দটির। কিন্তু ব্লকম্যানের অভিমত গ্রহণে আপত্তি করে বেভারিজ (Beveridge) বলেন, নাম হিসেবে রাজশাহী অপেক্ষা অর্বাচীন এবং এর অবস্থান ছিল রাজা গণেষের জমিদারী ভাতুড়িয়া পরগনা থেকে অনেক দূরে।\n" +
                "\n" +
                " \n" +
                "\n" +
                "রাজা গণেশের সময় এই নামটির উদ্ভব হলে তার উল্লেখ টোডরমল প্রণীত খাজনা আদায়ের তালিকায় অথবা আবুল ফজলের আইন-ই-আকবরী নামক গ্রন্থে অবশ্যই পাওয়া যেত। ডব্লিউ ডব্লিউ হান্টারের মতে, নাটোরের রাজা রামজীবনের জমিদারী রাজশাহী নামে পরিচিত ছিল এবং সেই নামই ইংরেজরা গ্রহণ করেন এই জেলার জন্য। অনেকে এসব ব্যাখ্যাকে যথার্থ ইতিহাস মনে করেননা।তবে ঐতিহাসিক সত্য যে, বাংলার নবাবী আমল ১৭০০ হতে ১৭২৫ সালে নবাব মুশির্দকুলী খান সমগ্র বাংলাদেশকে রাজস্ব আদায়ের সুবিধার জন্য ১৩ (তের) টি চাকলায় বিভক্ত করেন। যার মধ্যে ‘চারুলা রাজশাহী’ নামে একটি বৃহৎ বিস্তৃতি এলাকা নির্ধারিত হয়। এর মধ্যে প্রবাহিত পদ্মা বিধৌত ‘রাজশাহী চাকলা’ কে তিনি উত্তরে বতর্মান রাজশাহী ও দক্ষিণে মুর্শিদাবাদের সঙ্গে অপর অংশ রাজশাহী নিজ চাকলা নামে অভিহিত করেন।\n" +
                "\n" +
                "প্রথমে সমগ্র চাকলার রাজস্ব আদায় করতেন হিন্দু রাজ-জমিদার উদয় নারায়ণ। তিনি ছিলেন মুর্শিদ কুলির একান্ত প্রীতিভাজন ব্যক্তি। যে জন্য নবাব তাকে রাজা উপাধী প্রদান করেন। দক্ষিণ চাকলা রাজশাহী নামে বিস্তৃত এলাকা যা সমগ্র রাজশাহী ও পাবনার অংশ নিয়ে অবস্থিত ছিল, তা ১৭১৪ সালে নবাব মুর্শিদকুলী খান নাটোরের রামজীবনের নিকট বন্দোবস্ত প্রদান করেন। এই জমিদারী পরে নাটোরের রাণী ভবানীর শাসনে আসে ও বহু অঞ্চল নিয়ে বিস্তৃতি লাভ করে। রামজীবন প্রথম নাটোর রাজ ১৭৩০ সালে মারা গেলে তার দত্তক পুত্র রামকান্ত রাজা হন। ১৭৫১ সালে রামকান্তের মৃত্যুর পরে তার স্ত্রী ভবানী দেবী রাণী ভবানী নামে উত্তরাধীকারী লাভ করেন। অনেকের মতে, প্রথম রাজা উদয় নারায়ণের উপর প্রীতি বশত এই চাকলার নাম রাজশাহী করেন নবাব মুর্শিদকুলী খান।\n" +
                "কিন্তু ঐতিহাসিক অক্ষয় কুমার মৈত্রেয়র মতে, রাণী ভবানীর দেয়া নাম রাজশাহী । অবশ্য মিঃ গ্রান্ট লিখেছেন যে, রাণী ভবানীর জমিদারীকেই রাজশাহী বলা হতো এবং এই চাকলার বন্দোবস্তের কালে রাজশাহী নামের উল্লেখ পাওয়া যায়।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Natore");
        hashMap.put("policeCall","07716-6922");
        hashMap.put("policeStationName","Natore Police Station");
        hashMap.put("history","ভারতবর্ষের ইতিহাসে নাটোর একটি বিশিষ্ট স্থানের নাম । এই নাম তার শাসকশ্রেণী এবং তার অধিবাসীদের জীবনসংগ্রাম আর সংস্কৃতির কারণেই ইতিহাস বিখ্যাত । পাঠান-মোঘল-ইংরেজ এমনকি পাকিস্তানি দুঃশাসনের ইতিহাসে যুগে যুগে শোষণ বঞ্চণা আর নির্যাতনের বিরুদ্ধে আত্ম অধিকার প্রতিষ্ঠার সংগ্রামে উল্লেখযোগ্য হয়ে আছে । ১৯৫২ এর ভাষা আন্দোলন, ৬২ এর সাম্প্রদায়িক শিক্ষা কমিশন বিরোধী আন্দোলন , ৬৬ এর ছয় দফার সমর্থনে আন্দোলন, ৬৯ এর গণঅভ্যূত্থান এবং ১৯৭১ এর মহান মুক্তিযুদ্ধে নাটোরবাসির অবদান দেশের অপরাপর জেলাগুলোর চেয়ে কম নয় । সে কারণে নাটোর ঐতিহাসিকভাবে শুধু ভারতবর্ষের ইতিহাসেই নয়, সভ্য দুনিয়ার সকল দেশে তার স্বতন্ত্র্য পরিচিতি আছে ।\n" +
                "\n" +
                "\n" +
                "\n" +
                "নাটোর রাজবাড়ী\n" +
                "\n" +
                "নাটোর মোগল শাসনামলের শেষ সময় থেকে বাংলার ক্ষমতার অন্যতম প্রাণকেন্দ্রে পরিণত হয় । বিশেষ করে নবাবী আমলে তার ব্যাপক ব্যাপ্তি ঘটে । বাংলার সুবেদার মুর্শিদ কুলী খানের (১৭০১-১৭২৭ শাসনকাল) প্রত্যক্ষ তত্ত্বাবধানে বরেন্দ্রী ব্রাহ্মণ রঘুনন্দন তার ছোটভাই রামজীবনের নামে এতদ অঞ্চলে জমিদারী প্রতিষ্ঠা করেন । রাজা রামজীবন রায় নাটোর রাজবংশের প্রতিষ্ঠাতা। কথিত আছে লস্কর খাঁতার সৈন্য-সামন্তদের জন্য যে স্থান হতে রসদ সংগ্রহ করতেন, কালক্রমে তার নাম হয় লস্করপুর পরগনা। এই পরগনার একটি নীচু চলাভূমির নাম ছিল ছাইভাংগা বিল। ১৭১০ সনে রাজা রামজীবন রায় এই স্থানে মাটি ভরাট করে তার রাজধানী স্থাপন করেন। কালক্রমে মন্দির, প্রাসাদ, দীঘি, উদ্যান ও মনোরম অট্টালিকা দ্বারা সুসজ্জিত নগরীতে পরিণত হয়। ধীরে ধীরে ছাইভাংগা বিলের উপরে প্রতিষ্ঠিত হয় নাটোর শহর। সুবেদার মুর্শিদ কুলী খানের সুপারিশে মোঘল সম্রাট আলমগীরের নিকট হতে রামজীবন ২২ খানা খেলাত এবং রাজা বাহাদুর উপাধি লাভ করেন । নাটোর রাজ্য উন্নতির চরম শিখরে পৌছে রাজা রামজীবনের দত্তক পুত্র রামকান্তের স্ত্রী রাণী ভবানীর রাজত্বকালে । ১৭৮২ সালে ক্যাপ্টেন রেনেল এর ম্যাপ অনুযায়ী রাণী ভবানীর জমিদারীর পরিমাণ ছিল ১২৯৯৯ বর্গমাইল । শাসন ব্যবস্থার সুবিধার জন্য সুবেদার মুর্শিদ কুলী খান বাংলাকে ১৩ টি চাকলায় বিভক্ত করেন । এর মধ্যে রাণী ভবানীর জমিদারী ছিল ৮ চাকলা বিস্তৃত । এই বিশাল জমিদারীর বাৎসরিক আয় ছিল দেড় কোটি টাকার অধিক । বর্তমান বাংলাদেশের রাজশাহী, পাবনা, বগুড়া, রংপুর, দিনাজপুর, কুষ্টিয়া, যশোর এবং পশ্চিমবঙ্গের মালদা, মুর্শিদাবাদ ও বীরভূম জেলাব্যাপী বিস্তৃত ছিল তার রাজত্ব । এছাড়া ময়মনসিংহ জেলার পুখুরিয়া পরগণা এবং ঢাকা জেলার রাণীবাড়ী অঞ্চলটিও তার জমিদারীর অন্তর্গত ছিল । এ বিশাল জমিদারীর অধিশ্বরী হওয়ার জন্যই বোধহয় তাকে মহারাণী উপাধী দেয়া হয় এবং তাকে অর্ধ-বঙ্গেশ্বরী হিসাবে অভিহিত করা হতো । একে কেন্দ্র করেই গড়ে উঠেছিল এ অঞ্চলের সর্ববৃহৎ সামন্তরাজ এবং এক মহিয়ষী নারীর রাজ্যশাসন ও জনকল্যাণ ব্যবস্থা।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Joypurhat");
        hashMap.put("policeCall","01713-374077");
        hashMap.put("policeStationName","Joypurhat Police Station");
        hashMap.put("history","ষোড়শ এবং সপ্তদশ শতাব্দী পযর্ন্ত  জয়পুরহাটের ইতিহাস খুবই অস্পষ্ট। কারণ এই সময় ভারতবর্ষের ইতিহাসে জয়পুরহাটের কোন স্বতন্ত্র ভৌগোলিক অবস্থান ছিল না ।  জয়পুরহাট দীর্ঘকাল গৌড়ের পাল এবং সেন রাজাদের রাজ্য ভূক্ত ছিল। পূর্বে বর্তমান জয়পুরহাটের স্থানীয় নাম ছিল বাঘাবাড়ীহাট, পরবর্তীকালে কাগজপত্রে গোপেন্দ্রগঞ্জহাট লেখা হতে থাকে। সে সময় জয়পুরহাট  নামে কোন স্থানের অস্তিত্ব পাওয়া যায় না। বর্তমান জয়পুরহাট এবং পাঁচবিবি উপজেলার গ্রামসমূহ নিয়ে একসময় লালবাজার থানা গঠিত হয়েছিল।  জয়পুরহাট সদর থানার পশ্চিম প্রান্তে যমুনা নদীর পূর্বতীরে পুরানাপৈলে এই থানা অবস্থিত ছিল । স্থানটি বর্তমানে করিমনগর বলে পরিচিত। করিমনগর সরকারি প্রাথমিক বিদ্যালয়ের নিকট যমুনা নদীর ঘাটকে আজও  থানার ঘাট বলা হয় । এর দক্ষিণে যে স্থানে বাজার বসত সে স্থানকে এখনও বাজারের ভিটা বলা হয়ে থাকে। এই লাল বাজারেই  তখন পোস্ট অফিস স্থাপিত হয়েছিল । সাব-রেজিষ্ট্রি অফিস ছিল আক্কেলপুর রেল ষ্টেশনের পূর্বদিকে নবাবগঞ্জ নামক স্থানে। লাল বাজার থানার এবং খঞ্জনপুর কুঠীর ভারপ্রাপ্ত ইংরেজ কর্মকর্তার তত্ত্বাবধানে পলিবাড়ি, খঞ্জনপুর, পুরানাপৈল, পাঁচবিবি প্রভৃতি স্থানে নীলকুঠি স্থাপিত হয়েছিল। তৎকালে  লালবাজার ছিল শহর এবং সাধারণ মানুষের জীবিকা অর্জনের একমাত্র কর্মস্থল । দেশে তখনও রেল লাইন স্থাপিত হয়নি । মালামাল আমদানি, রপ্তানি এবং একস্থান হতে অন্য স্থানে স্থানান্তরিত করার জন্য নদীপথ ব্যতীত অন্য কোন উপায় ছিল না। তখন যমুনা নদী ছিল ভীষণ খরস্রোতা । লাল বাজার থানার ঘাটে মহাজনী ও সওদাগরী  নৌকা ভীড়ত ।  এ নদী পথেই দূর দূরান্তে যাতায়াত ও ব্যবসা বাণিজ্য চলত।\n" +
                "\n" +
                " \n" +

                "     সে সময় লাল বাজার, ক্ষেতলাল এবং বদলগাছী থানা দিনাজপুর জেলার অন্তর্ভুক্ত ছিল । কিন্তু তখন  দিনাজপুর, রংপুর ও রাজশাহী জেলার আয়তন এত বৃহৎ ছিল যে, একজন প্রশাসকের পক্ষে সমগ্র জেলায় নজর রাখা কষ্টসাধ্য হয়ে যেত। তাই ১৮২১ সালে ভারতের তৎকালীন বড়লাট বাহাদুরের এক ফরমান বলে রাজশাহী, রংপুর এবং দিনাজপুর জেলা হতে কয়েকটি থানা নিয়ে বগুড়া জেলা গঠন করা হয় । এ সময় রাজশাহী হতে শেরপুর , বগুড়া এবং আদমদিঘী থানা, রংপুর হতে দেওয়ানগঞ্জ ও গোবিনদগঞ্জ  থানা এবং দিনাজপুর হতে ক্ষেতলাল, বদলগাছী ও লাল বাজার থানা বিচ্ছিন্ন  করে বগুড়া জেলার সৃষ্টি হয়েছিল । ব্যান্ডেল সাহেব ছিলেন বগুড়ার প্রথম ম্যাজিস্ট্রেট ।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Chapainawabganj");
        hashMap.put("policeCall","01745-733204");
        hashMap.put("policeStationName","Chapainawabganj Police Station");
        hashMap.put("history","চাঁপাইনবাবগঞ্জ নামটি সাম্প্রতিককালের। ইতোপূর্বে এই এলাকা ‘নবাবগঞ্জ’ নামে পরিচিত ছিল। চাঁপাইনবাবগঞ্জের নামকরণ সম্পর্কে জানা যায়, প্রাক-ব্রিটিশ আমলে এ অঞ্চল ছিল মুর্শিদাবাদের নবাবদের বিহারভূমি এবং এর অবস্থান ছিল বর্তমান  সদর উপজেলার দাউদপুর মৌজায়। নবাবরা তাঁদের পাত্র-মিত্র ও পারিষদসহ এখানে শিকার করতে আসতেন বলে এ স্থানের নাম হয় নবাবগঞ্জ। বলা হয়ে থাকে যে, বাংলা-বিহার-উড়িষ্যার নবাব সরফরাজ খাঁ (১৭৩৯-৪০ খ্রি) একবার শিকারে এসে যে স্থানটিতে ছাউনি ফেলেছিলেন সে জায়গাটিই পরে নবাবগঞ্জ নামে পরিচিত হয়ে উঠে। তবে অধিকাংশ গবেষকের মতে, নবাব আলীবর্দী খাঁর আমলে (১৭৪০-৫৬ খ্রি) নবাবগঞ্জ নামকরণ হয়।\n" +
                "\n" +
                "অষ্টাদশ শতকের প্রথম ও মধ্যভাগে বর্গীর ভয়ে পশ্চিমবঙ্গ থেকে লোকজন ব্যাপকভাবে এ এলাকায় এসে বসতি স্থাপনের ফলে স্থানটি এক কর্মব্যস্ত জনপদে পরিণত হয়। কালক্রমে নবাবগঞ্জের নাম চারদিকে ছড়িয়ে পড়ে। নবাবগঞ্জের ডাকঘর চাঁপাই গ্রামে অবস্থিত হওয়ায় নবাবগঞ্জ তখন ‘চাঁপাইনবাবগঞ্জ’ নামে পরিচিত হয়।\n" +
                "\n" +
                "\n" +
                "ইতিহাসসূত্রে এই ‘চাঁপাই’ নামকরণের কোনো সঠিক তথ্য পাওয়া যায় না। তবে এ ব্যাপারে দুরকম জনশ্রুতি প্রচলিত রয়েছে:-\n" +
                "\n" +
                "\n" +
                "১. বর্তমান নবাবগঞ্জ শহর থেকে ৫/৬ মাইল দুরে মহেশপুর নামে একটি গ্রাম রয়েছে। নবাব আমলে এই গ্রামে চম্পাবতী মতান্তরে‘চম্পারাণী’ বা ‘চম্পাবাঈ’ নামে এক সুন্দরী বাঈজি বাস করতেন। তাঁর নৃত্যের খ্যাতি আশেপাশে ব্যাপকভাবে ছড়িয়ে পড়ে এবং তিনি নবাবদের প্রিয়পাত্রী হয়ে ওঠেন। তাঁর নামানুসারে এই জায়গার নাম ‘চাঁপাই’ হয় বলে অনেকে মনে করেন।\n" +
                "\n" +
                "\n" +
                "২. ‘চাঁপাই’ নামকরণের আর একটি প্রচলিত মত হচ্ছে-এ অঞ্চল রাজা লখিন্দরের বাসভূমি ছিল। লখিন্দরের রাজধানীর নাম ছিল চম্পক। কিন্তু এই চম্পক নগরীর প্রকৃত অবস্থান কোথায় ছিল এ নিয়ে যথেষ্ট মতভেদ রয়েছে। যা হোকনবাবগঞ্জ জেলায় চসাই, চান্দপুর, বেহুলা গ্রাম ও বেহুলা নদীর সন্ধান পাওয়া যায়। বেহুলা নদী বর্তমানে মালদহ জেলায় প্রবাহিত হলেও দেশবিভাগ-পূর্বকালে  চাঁপাই, মালদহ জেলার অধীনে ছিল। ঐতিহাসিক অক্ষয়কুমার মৈত্রেয় (১৮৬১-১৯৩০ খ্রি) মনে করেন, বেহুলা তার স্বামীকে ভেলায় নিয়ে মহানন্দার উজান বেয়ে ভেসে গিয়ে ছিলেন। ভাষাবিদ ড. মুহম্মদ শহীদুল্লাহর (১৮৮৫-১৯৬৯ খ্রি) ‘বাঙলা সাহিত্যের কথা’ গ্রন্থের প্রথম খন্ডে বর্ণিত লাউসেনের শত্রুরা জামুতিনগর দিয়ে গৌড়ে প্রবেশ করে। বর্তমান ভোলাহাট উপজেলার জামবাড়িয়া পূর্বে জামুতিনগর নামে পরিচিত ছিল। এসবের ওপর ভিত্তি করে কোনো কোনো গবেষক চাঁপাইকে বেহুলার শ্বশুরবাড়ি চম্পকনগর বলে স্থির করেছেন এবং মত দিয়েছেন যে, চম্পক নাম থেকেই চাঁপাই নামের উৎপত্তি।");
        arrayList.add(hashMap);

        hashMap = new HashMap<>();
        hashMap.put("districtName","Naogaon");
        hashMap.put("policeCall","01320-123590");
        hashMap.put("policeStationName","Naogaon Police Station");
        hashMap.put("history","নওগাঁ শব্দর উৎপত্তি হয়েছে ‘নও’ (নতুন -ফরাসী শব্দ ) ও‘ গাঁ’ (গ্রাম ) শব্দ দু’টি হতে । এই শব্দ দু’টির অর্থ হলো নতুন গ্রাম । অসংখ্য ছোট ছোট নদীর লীলাক্ষেত্র এ অঞ্চল । আত্রাই নদী তীরবর্তী এলাকায় নদী বন্দর এলাকা ঘিরে নতুন যে গ্রাম গড়ে উঠে , কালক্রমে তা-ই নওগাঁ শহর এবং সর্বশেষ নওগাঁ জেলায় রুপামত্মরিত হয়। নওগাঁ শহর ছিল রাজশাহী জেলার অন্তর্গত । কালক্রমে এ এলাকাটি গ্রাম থেকে থানা এবং থানা থেকে মহকুমায় রুপ নেয় । ১৯৮৪ এর ১ মার্চ- এ নওগাঁ মহকুমা ১১টি উপজেলা নিয়ে জেলা হিসেবে ঘোষিত হয় । বাংলাদেশ উত্তর -পশ্চিমভাগ বাংলাদেশ - ভারত আমত্মজার্তিক সীমা রেখা সংলগ্ন যে ভূখন্ডটি ১৯৮৪ খ্রিঃ এর ১ মার্চের পূর্ব পর্যমত্ম অবিভক্ত রাজশাহী জেলার অধীন নওগাঁ মহকুমা হিসেবে গণ্য হ-তো, তা - ই এখন হয়েছে বাংশাদেশরে কন্ঠশোভা নওগাঁ জেলা । নওগাঁ প্রাচীন পৌন্ড্রবর্ধন ভূক্ত অঞ্চল ছিল। অন্য দিকে এটি আবার বরেন্দ্র ভূমিরও একটি অবিচ্ছেদ্য অংশ । নওগাঁর অধিবাসীরা ছিল প্রাচীন পুন্ড্র জাতির বংশধর । নৃতাত্বিকদের মতে , পুন্ডরা বিশ্বামিত্র বংশধর এবং বৈদিক যুগের মানুষ । মহাভারত পুন্ড্রদের অন্ধ ঋষি দীর্ঘতমার ঔরষজাত বলি রাজার বংশধর বলে উলে\u00ADখ করা হয়েছে । আবার কারো মতে, বাংলার আদিম পাদদর বংশধর রুপে পুন্ড্রদের বলা হয়েছে । এদিক দিয়ে বিচার করলে নওগাঁ যে প্রাচীন জনগোষ্ঠির আবসসহল ছিল তা সহজেই বলা যায় ।\n" +
                "\n" +
                "নওগাঁ জেলা আদিকাল হতেই বৈচিত্র ভরপুর । ছোট ছোট নদী বহুল এ জেলা প্রাচীনকাল হ- তেই কৃষি কাজের জন্য প্রসদ্ধি । কৃষি কাজের জন্য অত্যমত্ম উপযোগী এলাকায় বিভিন্ন অঞ্চল নিয়ে অসংখ্য জমিদার গোষ্ঠী গড়ে উঠে । এ জমিদার গোষ্ঠীর আশ্রয়েই কৃষি কাজ সহযোগী হিসেবে খ্যাত সাঁওতাল গোষ্ঠীর আগমন ঘটতে শুরু করে এ অঞ্চল । সাঁওতাল গোষ্ঠীর মতে এ জেলায় বসবাসরত অন্যান্য আদিবাসীদের মধ্যে মাল পাহাড়িয়া, কুর্মি,মহালী ও মুন্ডা বিশেষভাবে খ্যাত । নানা জাতি ও নানা ধর্মর মানুষের সমন্বয়ে গঠিত নওগাঁ জেলা মানব বৈচিত্র্য ভরপুর । অসংখ্য পুরাতন মসজিদ , মন্দির,গীর্জা ও জমিদার বাড়ি প্রমাণ কর নওগাঁ জেলা সভ্যতার ইতিহাস অনেক পুরাতন ।");
        arrayList.add(hashMap);

    }
}